Repository: ltdhk/bookstore
Catalog: App/lib/l10n/app_*.arb
Languages: id

# appTitle
source: Book Store
id: Toko Buku

source: Home
id: Beranda

source: Bookshelf
id: Rak Buku

# profile
source: My
id: Saya

source: Hot
id: Populer

# newTab
source: New
id: Baru

source: Male
id: Pria

source: Female
id: Wanita

# searchHint
source: Search for novel pop
id: Cari novel

# settings
source: Setting
id: Pengaturan

source: Dark Mode
id: Mode Gelap

source: Always Light Mode
id: Selalu Mode Terang

source: Auto unlock chapter
id: Buka kunci bab otomatis

source: Language
id: Bahasa

source: Version Update
id: Pembaruan Versi

# about
source: About Novel Pop
id: Tentang Novel Next

# rate
source: Rate Novel Pop
id: Beri Nilai Novel Next

source: Follow System
id: Ikuti Sistem

# alwaysDark
source: Always Dark Mode
id: Selalu Mode Gelap

# alwaysLight
source: Always Light Mode
id: Selalu Mode Terang

# regularMember
source: Member
id: Anggota

source: Log In
id: Masuk

source: Log Out
id: Keluar

source: Sign Up
id: Daftar

source: Register
id: Registrasi

source: Welcome Back
id: Selamat Datang Kembali

source: Log in to your account
id: Masuk ke akun Anda

source: Create Account
id: Buat Akun

source: Sign up to get started
id: Daftar untuk memulai

source: Password
id: Kata Sandi

source: Confirm Password
id: Konfirmasi Kata Sandi

# nickname
source: Nickname (Optional)
id: Nama Panggilan (Opsional)

source: Forgot Password?
id: Lupa Kata Sandi?

# pleaseEnterEmail
source: Please enter your email
id: Silakan masukkan email Anda

# pleaseEnterValidEmail
source: Please enter a valid email
id: Silakan masukkan email yang valid

# pleaseEnterPassword
source: Please enter your password
id: Silakan masukkan kata sandi Anda

# passwordMinLength
source: Password must be at least 6 characters
id: Kata sandi harus minimal 6 karakter

# pleaseConfirmPassword
source: Please confirm your password
id: Silakan konfirmasi kata sandi Anda

source: Passwords do not match
id: Kata sandi tidak cocok

# loginFailed
source: Login failed: {error}
id: Login gagal: {error}

# registrationFailed
source: Registration failed: {error}
id: Registrasi gagal: {error}

# registrationSuccessful
source: Registration successful! Please login.
id: Registrasi berhasil! Silakan login.

# agreeToTerms
source: Please agree to the Terms and Privacy Policy
id: Silakan setujui Ketentuan dan Kebijakan Privasi

source: I agree to the
id: Saya setuju dengan

source: User Agreement
id: Perjanjian Pengguna

source: and
id: dan

source: Privacy Policy
id: Kebijakan Privasi

source: Privacy Agreement
id: Perjanjian Privasi

# whenYouLogin
source: When you log in, we will assume that you have read and agreed to the
id: Saat Anda login, kami akan menganggap Anda telah membaca dan menyetujui

source: Log in via apple
id: Masuk dengan Apple

source: Log in via google
id: Masuk dengan Google

source: Log in via Email
id: Masuk dengan Email

# dontHaveAccount
source: Don't have an account?
id: Belum punya akun?

# alreadyHaveAccount
source: Already have an account?
id: Sudah punya akun?

source: SVIP MEMBERSHIP
id: KEANGGOTAAN SVIP

# readAllNovels
source: Read all novels on the site without restrictions
id: Baca semua novel di situs tanpa batasan

source: Subscribe now
id: Berlangganan sekarang

source: Reading history
id: Riwayat bacaan

source: Transaction Record
id: Catatan Transaksi

source: Setting
id: Pengaturan

source: My bookshelf
id: Rak buku saya

source: cancel
id: batal

source: Delete
id: Hapus

source: Delete Books
id: Hapus Buku

# deleteBooksConfirm
source: Delete {count} book(s) from your bookshelf?
id: Hapus {count} buku dari rak buku Anda?

# booksRemoved
source: Books removed from bookshelf
id: Buku dihapus dari rak buku

# errorRemovingBooks
source: Error removing books: {error}
id: Kesalahan menghapus buku: {error}

# noBooksInBookshelf
source: No books in your bookshelf
id: Tidak ada buku di rak buku Anda

source: Browse books
id: Jelajahi buku

source: Description
id: Deskripsi

source: Reads
id: Pembaca

source: Add to Bookshelf
id: Tambah ke Rak Buku

source: Read Now
id: Baca Sekarang

source: Continue Reading
id: Lanjutkan Membaca

source: Clear All
id: Hapus Semua

# clearHistoryConfirm
source: Are you sure you want to clear all reading history?
id: Apakah Anda yakin ingin menghapus semua riwayat bacaan?

# historyClearedSuccess
source: Reading history cleared successfully
id: Riwayat bacaan berhasil dihapus

# errorClearingHistory
source: Error clearing history: {error}
id: Kesalahan menghapus riwayat: {error}

# noReadingHistory
source: No reading history yet
id: Belum ada riwayat bacaan

# startReadingBooks
source: Start reading some books to see your history here
id: Mulai baca beberapa buku untuk melihat riwayat Anda di sini

# errorLoadingHistory
source: Error loading history: {error}
id: Kesalahan memuat riwayat: {error}

source: Just now
id: Baru saja

# minutesAgo
source: {minutes} minutes ago
id: {minutes} menit yang lalu

source: Today
id: Hari ini

source: Yesterday
id: Kemarin

# todayAt
source: Today {time}
id: Hari ini {time}

# yesterdayAt
source: Yesterday {time}
id: Kemarin {time}

# pleaseLoginToView
source: Please log in to view transaction records
id: Silakan login untuk melihat catatan transaksi

# noTransactionRecords
source: No transaction records yet
id: Belum ada catatan transaksi

# noTransactionHint
source: Your subscription purchases will appear here
id: Pembelian langganan Anda akan muncul di sini

# errorLoadingOrders
source: Error loading orders: {error}
id: Kesalahan memuat pesanan: {error}

source: Load More
id: Muat Lebih Banyak

source: No more orders
id: Tidak ada pesanan lagi

source: Pending
id: Tertunda

source: Paid
id: Dibayar

source: Refunded
id: Dikembalikan

source: Failed to load subscriptions
id: Gagal memuat langganan

source: Subscribe to SVIP
id: Berlangganan SVIP

source: Unlock all content
id: Buka kunci semua konten

source: Monthly Plan
id: Paket Bulanan

source: Quarterly Plan
id: Paket Triwulan

source: Yearly Plan
id: Paket Tahunan

# perMonth
source: /month
id: /bulan

# save
source: Save {percent}%
id: Hemat {percent}%

source: Subscribe
id: Berlangganan

source: Use Passcode
id: Gunakan Kode

source: Enter Passcode
id: Masukkan Kode

# passcodeHint
source: Enter your 16-digit passcode
id: Masukkan kode 16 digit Anda

source: Apply
id: Terapkan

# invalidPasscode
source: Invalid passcode format. Please enter a 16-digit code.
id: Format kode tidak valid. Silakan masukkan kode 16 digit.

# successfullySubscribed
source: Successfully subscribed to {productName}!
id: Berhasil berlangganan {productName}!

# subscriptionFailed
source: Subscription failed: {error}
id: Langganan gagal: {error}

source: Processing...
id: Memproses...

# chapter
source: Chapter {number}
id: Bab {number}

# chapterLocked
source: This chapter is locked
id: Bab ini terkunci

# unlockWithSVIP
source: Subscribe to SVIP to unlock
id: Berlangganan SVIP untuk membuka kunci

# chapterLoadError
source: Failed to load chapter
id: Gagal memuat bab

source: Loading...
id: Memuat...

# novelMaster
source: Novel Pop
id: Novel Next

source: Expires on
id: Berakhir pada
